# command-line utilities

brew "oven-sh/bun/bun"
brew "git"
brew "nvm"
brew "ffmpeg"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "pnpm"
brew "gh"
brew "dockutil"
brew "duti"
brew "wget"

# apps

cask "cursor"
cask "discord"
cask "raycast"
cask "whatsapp"
cask "warp"
cask "cleanshot"
cask "google-chrome"
cask "brave-browser"
cask "screen-studio"
cask "imageoptim"
cask "docker"
cask "obs"
cask "zed"
cask "ngrok"
cask "visual-studio-code"
cask "figma"
cask "proton-drive"
cask "proton-mail"
cask "proton-pass"
cask "protonvpn"
cask "fork"
cask "rectangle"
cask "paragon-ntfs"
cask "spotify"
cask "notion"
cask "notion-calendar"
cask "notion-mail"
cask "affinity-designer"
cask "affinity-photo"
cask "affinity-publisher"


# fonts

cask "font-hack-nerd-font"
cask "font-menlo-for-powerline"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code-nerd-font"